<template>
  <!--音乐播放器元素，不占dom空间-->
  <audio ref='audioRef'   style="display: none"></audio>

  <!--播放器盒子-->
  <div class="hs-height-100-vh" >
    <div class='hs-width-00100 hs-row-  ' style="height:calc(100% - 80px);">
      <!--左侧菜单-->
      <div class="hs-width-0020 hs-height-00100 hs-col- hs-color-white hs-background-color-black-08 hs-padding-15 hs-box-sizing-border-box ">
        <div class="hs-row-center-center hs-height-45 hs-font-weight-bold">
          <svg t="1716833423743" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2958" width="25" height="25"><path d="M540.574476 183.198476c-10.630095-32.377905-26.624-88.405333-48.030476-168.228571l-121.07581 374.003809H0A41950.841905 41950.841905 0 0 1 142.384762 512c38.912 33.889524 96.060952 95.670857 96.060952 117.51619 0 21.796571 28.086857-13.55581 28.086857-28.18438 0-14.628571 0.975238-36.571429-13.507047-55.442286-9.752381-12.580571-51.590095-46.518857-125.610667-101.766095H409.112381L484.888381 167.740952c18.383238 58.660571 33.158095 97.328762 44.373333 115.95581 16.822857 28.038095 34.230857 56.710095 54.125715 56.710095 13.263238 0 33.938286-2.779429 62.025142-8.387047l13.507048-25.356191c-30.378667-3.510857-50.712381-9.264762-60.952381-17.16419-15.311238-11.946667-41.447619-57.831619-57.392762-106.349715z" fill="currentColor" p-id="2959"></path><path d="M803.303619 266.386286c-63.634286 34.03581-205.287619 98.694095-235.227429 134.436571-29.988571 35.693714-23.30819 81.578667-52.370285 104.399238-29.062095 22.820571-63.975619 6.972952-96.548572 12.53181-21.650286 3.657143-43.25181 13.06819-64.804571 28.135619-69.827048 82.70019-100.10819 124.001524-90.843429 124.001524 6.192762 0 62.317714-76.946286 135.558096-102.790096 36.473905-12.873143 97.718857 24.137143 144.335238-12.629333 46.665143-36.717714 38.326857-66.852571 55.588571-105.715809 17.261714-38.863238 33.889524-34.474667 111.323429-75.190858 77.385143-40.71619 161.889524-80.847238 173.104762-98.986666 11.264-18.18819 18.090667-71.875048 18.090666-97.133715s-34.523429 54.905905-98.206476 88.941715z" fill="currentColor" p-id="2960"></path><path d="M380.342857 594.066286c3.120762 9.752381 8.923429 14.628571 17.408 14.628571s18.919619-4.096 31.353905-12.336762l-48.761905-2.291809zM904.582095 299.641905c-12.092952 27.843048-25.502476 45.153524-40.228571 51.882666-22.089143 10.093714-194.56 95.963429-228.010667 133.461334-33.499429 37.497905-10.142476 134.095238-6.339047 138.727619 3.705905 4.681143 15.60381-18.383238 17.017904-45.251048 1.414095-26.86781 1.560381-55.05219 39.204572-82.407619 37.692952-27.306667 119.466667-65.926095 166.765714-90.697143 47.34781-24.673524 59.392-35.05981 60.854857-62.610285 0.975238-18.334476-2.145524-32.719238-9.264762-43.105524z" fill="currentColor" p-id="2961"></path><path d="M909.165714 390.095238c-5.071238 25.551238-20.333714 44.568381-45.689904 57.100191-38.034286 18.822095-132.827429 61.68381-160.280381 92.647619-27.452952 30.96381-33.987048 63.878095-29.842286 99.474285 2.730667 23.79581 2.730667 40.228571 0 49.444572 6.339048-14.238476 12.970667-31.98781 19.699809-53.248 10.142476-31.841524 17.700571-60.074667 86.698667-102.4 69.046857-42.422857 116.297143-48.225524 129.414095-69.973334 8.777143-14.482286 8.777143-38.814476 0-73.045333z" fill="currentColor" p-id="2962"></path><path d="M915.748571 506.148571c-61.44 34.425905-98.304 55.686095-110.592 63.878096-18.432 12.239238-64.463238 46.031238-82.115047 77.238857-17.603048 31.207619-29.744762 84.114286 13.848381 122.099809 43.593143 37.985524 83.772952 21.942857 104.350476 8.143238 20.577524-13.750857 25.6-68.461714 11.068952-85.333333-14.482286-16.871619-14.482286 36.278857-34.767238 49.005714-20.284952 12.678095-84.504381 19.602286-72.899047-49.005714s107.666286-106.203429 136.582095-122.148571c19.309714-10.630095 30.768762-31.939048 34.474667-63.878096zM263.509333 669.891048c51.882667-2.535619 96.938667-0.682667 135.119238 5.607619 57.344 9.45981 166.326857 88.405333 183.100953 105.813333 16.725333 17.408-4.778667 14.238476-33.401905 49.785905-28.672 35.59619-28.672 85.625905 0 107.958857 28.623238 22.332952 147.748571 3.657143 158.671238 0 7.314286-2.438095-18.870857-11.410286-78.506667-26.819048-43.836952-0.975238-61.001143-10.044952-51.541333-27.209143 14.238476-25.84381 53.979429-63.24419 66.072381-79.969523 12.04419-16.676571 5.851429-44.470857-38.912-73.094096-44.763429-28.574476-131.754667-81.773714-184.124952-92.94019-52.419048-11.117714-62.70781-10.435048-101.522286 0-25.84381 7.021714-44.178286 17.310476-54.954667 30.866286z" fill="currentColor" p-id="2963"></path><path d="M258.048 703.390476c-0.097524 11.068952-9.020952 40.667429-26.770286 88.746667-17.749333 48.128-38.278095 115.614476-61.635047 202.556952 139.02019-104.69181 223.670857-165.497905 253.903238-182.369524 30.232381-16.871619 66.511238-23.600762 108.787809-20.187428-15.701333-19.602286-33.645714-29.403429-53.881904-29.403429-30.378667 0-77.921524 1.657905-112.932572 25.648762-23.405714 15.945143-59.196952 44.129524-107.471238 84.504381 20.675048-47.932952 33.840762-82.553905 39.497143-103.911619 8.43581-32.085333 17.749333-79.043048-7.168-79.043048-16.579048 0-27.355429 4.486095-32.329143 13.458286z" fill="currentColor" p-id="2964"></path></svg>

          <span class="hs-margin-left-5 hs-font-size-0103 ">星音乐</span></div>

        <div class="hs-col- hs-child-ini hs-child-padding-left-right-15 hs-child-height-40  hs-child-line-height-40  hs-child-display-inline-block hs-child-cursor-pointer">
          <router-link to="/rank"  active-class="hs-background-color-white-01 hs-border-radius-10">
            排行榜
          </router-link>

          <router-link to="/category"  active-class="hs-background-color-white-01 hs-border-radius-10">
            分类
          </router-link>
        </div>
      </div>

      <!--被嵌套路由内容显示 -->
      <div class="hs-width-0080 hs-row- hs-background-color-black-07">
        <router-view/>
      </div>
    </div>

    <!--歌曲控制面板-->
    <div class="hs-height-80 hs-position-relative hs-background-color-black-08">
      <!--播放进度条-->
      <musicProgress   :audioRef="musicStore.audioRef" />

      <!--正在播放音乐入口-->
      <musicActive   :curPlayMusicObj="musicStore.curPlayMusicObj" />

      <!--音乐播放控制-->
      <musicPanel :musicList="musicStore.musicList"  :songIndexObj="musicStore.songIndexObj" :audioRef="musicStore.audioRef" />
    </div>
  </div>
</template>

<script setup>
import musicPanel from 'com@/hsMusic/musicPanel';
import musicProgress from 'com@/hsMusic/musicProgress';
import musicActive from 'com@/hsMusic/musicActive';

import { useMusicStore } from "@/store/music";
const musicStore = useMusicStore()
//歌曲列表
const musicList=[
  {title:'好运来',img:'https://www.vae.zhangweicheng.xyz/VAE_Article_ShouTu/vae/6802ac85-9f22-4cc4-b812-87238f103c36.jpg',src:'https://www.vae.zhangweicheng.xyz/music/%E7%A5%96%E6%B5%B7%20-%20%E5%A5%BD%E8%BF%90%E6%9D%A5.mp3',lyric:'[00:00.00]好运来-祖海\n' +
        '[00:02.60]词：车行\n' +
        '[00:05.20]曲：戚建波\n' +
        '[00:07.80]好运来祝你好运来\n' +
        '[00:11.19]\n' +
        '[00:11.79]好运带来了喜和爱\n' +
        '[00:16.15]好运来我们好运来\n' +
        '[00:20.29]迎着好运兴旺发达通四海\n' +
        '[00:24.78]\n' +
        '[00:29.17]叠个千纸鹤再系个红飘带\n' +
        '[00:32.72]\n' +
        '[00:33.23]愿善良的人们天天好运来\n' +
        '[00:37.36]你勤劳生活美你健康春常在\n' +
        '[00:41.71]你一生的忙碌为了笑逐颜开\n' +
        '[00:46.71]\n' +
        '[00:47.36]打个中国结请春风剪个彩\n' +
        '[00:51.40]愿祖国的日月年年好运来\n' +
        '[00:55.56]你凤舞太平年你龙腾新时代\n' +
        '[01:00.04]你幸福的家园迎来百花盛开\n' +
        '[01:05.36]好运来祝你好运来\n' +
        '[01:09.68]好运带来了喜和爱\n' +
        '[01:13.91]好运来我们好运来\n' +
        '[01:18.17]迎着好运兴旺发达通四海\n' +
        '[01:24.22]\n' +
        '[01:33.43]叠个千纸鹤再系个红飘带\n' +
        '[01:37.46]愿善良的人们天天好运来\n' +
        '[01:41.64]你勤劳生活美你健康春常在\n' +
        '[01:46.00]你一生的忙碌为了笑逐颜开\n' +
        '[01:50.95]\n' +
        '[01:51.46]打个中国结请春风剪个彩\n' +
        '[01:55.74]愿祖国的日月年年好运来\n' +
        '[01:59.87]你凤舞太平年你龙腾新时代\n' +
        '[02:04.18]你幸福的家园迎来百花盛开\n' +
        '[02:09.62]好运来祝你好运来\n' +
        '[02:14.05]好运带来了喜和爱\n' +
        '[02:18.24]好运来我们好运来\n' +
        '[02:22.52]迎着好运兴旺发达通四海\n' +
        '[02:26.74]好运来祝你好运来\n' +
        '[02:31.10]好运带来了喜和爱\n' +
        '[02:35.35]好运来我们好运来\n' +
        '[02:39.63]迎着好运兴旺发达通四海\n' +
        '[02:45.09]\n' +
        '[02:59.12]好运来祝你好运来\n' +
        '[03:03.26]好运带来了喜和爱\n' +
        '[03:07.43]好运来我们好运来\n' +
        '[03:11.68]迎着好运兴旺发达通四海\n' +
        '[03:16.02]通四海好运来'},
  {title:'三年二班',img:'https://www.vae.zhangweicheng.xyz/apple_Article_Head/vae/7e6361a6-58f7-4abb-997e-bdd88dd1dc06.jpg',src:'https://www.vae.zhangweicheng.xyz/music/%E5%91%A8%E6%9D%B0%E4%BC%A6%20-%20%E4%B8%89%E5%B9%B4%E4%BA%8C%E7%8F%AD.mp3',lyric:'[ti:三年二班]\n' +
        '[ar:周杰伦]\n' +
        '[al:叶惠美]\n' +
        '\n' +
        '[00:00.30]三年二班\n' +
        '[00:01.30]作词：方文山  作曲：周杰伦\n' +
        '[00:02.30]演唱：周杰伦\n' +
        '[00:03.30]\n' +
        '[00:06.45]训导处报告 训导处报告\n' +
        '[00:09.27]三年二班 周杰伦\n' +
        '[00:11.46]马上到训导处来\n' +
        '[00:12.71]\n' +
        '[00:40.05]眼睛你要擦亮 记住我的模样\n' +
        '[00:42.71]表情不用太紧张\n' +
        '[00:44.02]我是 三年二班\n' +
        '[00:45.37]我专心打球的侧脸还满好看\n' +
        '[00:47.52]黑板是吸收知识的地方\n' +
        '[00:49.40]只是教室的阳光\n' +
        '[00:50.66]那颜色我不太喜欢\n' +
        '[00:51.97]没有操场的自然\n' +
        '[00:53.32]为何比较漂亮的都是在隔壁班\n' +
        '[00:56.04]还有考卷的答案\n' +
        '[00:57.34]我刚好都不会算\n' +
        '[00:58.64]没关系 再继续努力 没关系\n' +
        '[01:01.28]为什么上课时举手很难\n' +
        '[01:03.89]为什么拿线上宝物简单\n' +
        '[01:06.69]为什么女生不喜欢太胖\n' +
        '[01:09.22]为什么都别人手机在响\n' +
        '[01:11.81]正手发长球的打法只是初级乒乓\n' +
        '[01:14.71]反手短打再狠狠杀球是高级乒乓\n' +
        '[01:17.27]回转技巧乒乓 前场速攻乒乓\n' +
        '[01:19.95]对墙壁 在练习 乒乓 乒乓\n' +
        '[01:22.64]这第一名到底要多强\n' +
        '[01:25.93]（不用问 一定有人向你挑战）\n' +
        '[01:27.94]到底还要过多少关\n' +
        '[01:31.14]（不用怕 告诉他们谁是男子汉）\n' +
        '[01:33.46]可不可以不要这个奖\n' +
        '[01:36.51]（不想问 我只想要流一点汗）\n' +
        '[01:38.79]我当我自己的裁判\n' +
        '[01:41.86]（不想说 选择对手跟要打的仗）\n' +
        '[01:44.11]这第一名到底要多强\n' +
        '[01:46.95]（不用问 一定有人向你挑战）\n' +
        '[01:49.24]到底还要过多少关\n' +
        '[01:52.57]（不用怕 告诉他们谁是男子汉）\n' +
        '[01:54.80]可不可以不要这个奖\n' +
        '[01:57.84]（不想问 我只想要流一点汗）\n' +
        '[02:00.10]我当我自己的裁判\n' +
        '[02:03.10]（不想说 选择对手跟要打的仗）\n' +
        '[02:05.28]\n' +
        '[02:08.13]全体师生注意\n' +
        '[02:09.46]今天我要表扬一位同学\n' +
        '[02:11.97]他为校争光\n' +
        '[02:13.44]我们要向他看齐\n' +
        '[02:15.03]\n' +
        '[02:28.06]我不想 就这样一直走\n' +
        '[02:30.34]每天都遇上 充满敌意那种眼光\n' +
        '[02:33.43]等机会 就是要打倒对方\n' +
        '[02:36.10]这种结果我不要 这虚荣的骄傲\n' +
        '[02:38.93]这目的很好笑\n' +
        '[02:40.21]我其实都知道 你只是想炫耀\n' +
        '[02:42.90]我永远做不到 你永远赢不了\n' +
        '[02:45.50]我永远做不到\n' +
        '[02:46.79]你永远赢不了 永远都赢不了\n' +
        '[02:49.58]走下乡 寻找哪有花香\n' +
        '[02:52.07]（为什么 这么简单你做不到）\n' +
        '[02:54.88]坐车厢 朝着南下方向\n' +
        '[02:57.32]（为什么 这种速度你追不到）\n' +
        '[03:00.31]鸟飞翔 穿过这条小巷\n' +
        '[03:02.80]（为什么 这么简单你做不到）\n' +
        '[03:05.60]仔细想 这种生活安详\n' +
        '[03:08.07]（为什么 这种速度你追不到）\n' +
        '[03:10.93]不好笑 不好笑 不好笑\n' +
        '[03:12.71]不好笑 不好笑 不好笑\n' +
        '[03:14.57]\n' +
        '[03:32.15]这第一名到底要多强\n' +
        '[03:35.31]（不用问 一定有人向你挑战）\n' +
        '[03:37.48]到底还要过多少关\n' +
        '[03:40.59]（不用怕 告诉他们谁是男子汉）\n' +
        '[03:42.92]可不可以不要这个奖\n' +
        '[03:45.90]（不想问 我只想要流一点汗）\n' +
        '[03:48.14]我当我自己的裁判\n' +
        '[03:51.25]（不想说 选择对手跟要打的仗）\n' +
        '[03:53.99]我不想 就这样一直走\n' +
        '[03:56.04]每天都遇上 充满敌意那种眼光\n' +
        '[03:58.79]等机会 就是要打倒对方\n' +
        '[04:01.82]这种结果我不要 这虚荣的骄傲\n' +
        '[04:04.17]我不想 就这样一直走\n' +
        '[04:06.34]每天都遇上 充满敌意那种眼光\n' +
        '[04:09.34]等机会 就是要打倒对方\n' +
        '[04:12.11]这种结果我不要 这虚荣的骄傲\n' +
        '[04:14.81]走下乡 寻找哪有花香\n' +
        '[04:17.14]\n' +
        '[04:20.24]坐车厢 朝着南下方向\n' +
        '[04:22.45]\n' +
        '[04:25.62]鸟飞翔 穿过这条小巷\n' +
        '[04:27.96]\n' +
        '[04:30.80]仔细想 这种生活安详\n' +
        '[04:33.06]'},  {title:'有何不可',img:'https://www.vae.zhangweicheng.xyz/VAE_Article_ShouTu/vae/e4b7116b-b04b-4381-b8a7-1665d54b97dd.png',src:'https://www.vae.zhangweicheng.xyz/music/%E8%AE%B8%E5%B5%A9%20-%20%E6%9C%89%E4%BD%95%E4%B8%8D%E5%8F%AF%EF%BC%88%E7%8B%AC%E7%99%BD%E7%89%88%EF%BC%89.mp3',lyric:'\n' +
        '[00:00.00]有何不可-许嵩\n' +
        '[00:05.76]词：许嵩\n' +
        '[00:11.53]曲：许嵩\n' +
        '[00:23.07]天空好想下雨\n' +
        '[00:25.13]我好想住你隔壁\n' +
        '[00:27.41]傻站在你家楼下\n' +
        '[00:29.42]抬起头数乌云\n' +
        '[00:31.86]如果场景里出现一架钢琴\n' +
        '[00:34.19]我会唱歌给你听\n' +
        '[00:36.59]哪怕好多盆水往下淋\n' +
        '[00:39.69]\n' +
        '[00:41.95]夏天快要过去\n' +
        '[00:44.00]请你少买冰淇淋\n' +
        '[00:46.42]天凉就别穿短裙\n' +
        '[00:48.63]别再那么淘气\n' +
        '[00:51.04]如果有时不那么开心\n' +
        '[00:53.37]我愿意将格洛米借给你\n' +
        '[00:55.65]你其实明白我心意\n' +
        '[00:59.01]为你唱这首歌\n' +
        '[01:01.24]没有什么风格\n' +
        '[01:03.55]它仅仅代表着\n' +
        '[01:05.34]\n' +
        '[01:05.97]我想给你快乐\n' +
        '[01:08.32]为你解冻冰河\n' +
        '[01:10.71]为你做一只扑火的飞蛾\n' +
        '[01:14.23]没有什么事情是不值得\n' +
        '[01:17.91]为你唱这首歌\n' +
        '[01:20.26]没有什么风格\n' +
        '[01:22.55]它仅仅代表着\n' +
        '[01:24.34]\n' +
        '[01:24.94]我希望你快乐\n' +
        '[01:27.38]为你辗转反侧\n' +
        '[01:29.77]为你放弃世界有何不可\n' +
        '[01:33.10]夏末秋凉里带一点温热\n' +
        '[01:36.86]有换季的颜色\n' +
        '[01:39.53]\n' +
        '[01:58.10]天空好想下雨\n' +
        '[02:00.05]我好想住你隔壁\n' +
        '[02:02.37]傻站在你家楼下\n' +
        '[02:04.53]抬起头数乌云\n' +
        '[02:06.87]如果场景里出现一架钢琴\n' +
        '[02:09.43]我会唱歌给你听\n' +
        '[02:11.67]哪怕好多盆水往下淋\n' +
        '[02:13.97]\n' +
        '[02:14.63]往下淋往下淋\n' +
        '[02:16.78]夏天快要过去\n' +
        '[02:19.03]请你少买冰淇淋\n' +
        '[02:21.41]天凉就别穿短裙\n' +
        '[02:23.45]别再那么淘气\n' +
        '[02:26.03]如果有时不那么开心\n' +
        '[02:28.34]我愿意将格洛米借给你\n' +
        '[02:30.62]你其实明白我心意\n' +
        '[02:34.03]为你唱这首歌\n' +
        '[02:36.28]没有什么风格\n' +
        '[02:38.56]它仅仅代表着\n' +
        '[02:41.03]我想给你快乐\n' +
        '[02:43.35]为你解冻冰河\n' +
        '[02:45.74]为你做一只扑火的飞蛾\n' +
        '[02:49.24]没有什么事情是不值得\n' +
        '[02:52.92]为你唱这首歌\n' +
        '[02:55.30]没有什么风格\n' +
        '[02:57.63]它仅仅代表着\n' +
        '[02:59.99]我希望你快乐\n' +
        '[03:02.37]为你辗转反侧\n' +
        '[03:04.71]为你放弃世界有何不可\n' +
        '[03:08.05]夏末秋凉里带一点温热\n' +
        '[03:11.31]\n' +
        '[03:21.67]为你解冻冰河\n' +
        '[03:23.90]为你做一只扑火的飞蛾\n' +
        '[03:27.11]没有什么事情是不值得\n' +
        '[03:30.37]\n' +
        '[03:31.14]为你唱这首歌\n' +
        '[03:33.25]没有什么风格\n' +
        '[03:35.59]它仅仅代表着\n' +
        '[03:38.03]我希望你快乐\n' +
        '[03:40.44]为你辗转反侧\n' +
        '[03:42.77]为你放弃世界有何不可\n' +
        '[03:46.13]夏末秋凉里带一点温热\n' +
        '[03:49.74]有换季的颜色'},
];
musicStore.musicList = musicList

// 播放器ref
const audioRef = ref(null)

/**
 * 监听器
 */
watch(() => { return musicStore.curPlayMusicObj}, function (value, oldvalue) {
  musicStore.audioRef.src=value.src;
  musicStore.audioRef.play();
})

// dom挂载完成事件
onMounted(()=>{
  musicStore.audioRef = audioRef.value
  musicStore.audioRef.src=musicStore.curPlayMusicObj.src;
  musicStore.audioRef.addEventListener('error', function() {
    console.warn('音频文件加载失败');
  });
})

</script>